# https://github.com/Homebrew/homebrew-bundle
# Install path for cask apps
cask_args appdir: '/Applications'

#### Tap into cask-fonts
tap 'homebrew/cask-fonts'
tap 'sambadevi/powerlevel9k'

#### Install brew packages
brew 'git'
brew 'bash-completion'
brew 'brew-cask-completion'
brew 'cowsay'
brew 'dockutil'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gdbm'
brew 'glances'
brew 'glib'
brew 'gnupg2'
brew 'gnutls'
brew 'go'
brew 'imagemagick'
brew 'jq'
brew 'libgcrypt'
brew 'libunistring'
brew 'libusb'
brew 'libxml2'
brew 'netcat'
brew 'nmap'
brew 'node'
brew 'powerlevel9k'
brew 'speedtest-cli'
brew 'sqlite'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tree'
brew 'wget'
brew 'xz'
brew 'zsh'
brew 'zsh-completions'

#### Install cask fonts
cask 'font-meslo-for-powerline'

#### Install cask apps
cask '1password'
cask 'atom'
cask 'autodmg'
cask 'balenaetcher'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'little-snitch'
cask 'minikube'
cask 'platypus'
cask 'powershell'
cask 'slack'
cask 'spectacle'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vlc'

# TODO: Fails; kext-approval needed.
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'

cask 'wireshark'
cask 'xquartz'
